
print("========================")
print("Добро пожаловать !!!")
def printd(text, delay=0.3):
    from time import sleep
    for char in text:
        print(char, end='')
        sleep(0.3)

print("========================")
print('Загрузка терминала')
printd('...........')
print("")
    # --------------------------------------------------------------------------------------
def print_profile():
    print("========================")
    print("Профиль терминала:")
    print("========================")
    print("[1]. Войти в личный кабинет")
    print("[2]. Войти в раздел меню")
    print("------------------------")
    print(">>>>>>>>>>>>>>>>>>>>>>>>>")
    # --------------------------------------------------------------------------------------
def print_kabinet():
    print("======================================")
    print(" Добро пожаловать в личный кабинет!:")
    print("======================================")
    print("[0]. Изменить пароль")
    print("[0]. Настройка терминала ")
    print("[0]. Весь персонал")
    print("[0]. Списки чеков")
    print("[0]. Оплатить заказ")
    print("[0]. ...")
    print("[0]. ...")
    print("[0]. ...")
    print("[1]. Выйти из кабинета")
    print("-------------------------")
    print(">>>>>>>>>>>>>>>>>>>>>>>>>")
    # --------------------------------------------------------------------------------------
def print_razdel():
    print("------------------------")
    print("     Раздел меню:")
    print("------------------------")
    print("[1]. Фаст-фуд")
    print("[2]. Салаты")
    print("[3]. Супы")
    print("[4]. Вернуться в начальный профиль")
    print("[5]. Оплатить заказ $ ")
    print("------------------------")
    print(">>>>>>>>>>>>>>>>>>>>>>>>>")
    # --------------------------------------------------------------------------------------
def print_fast():
    print("------------------------")
    print("     Меню:")
    print("------------------------")
    print("[1]. Картошка - 5$")
    print("[2]. Гамбургер - 10$")
    print("[3]. Твистер - 12$")
    print("[4]. Стрипсы - 9$")
    print("[5]. луковые кольца - 6$")
    print("[6]. Назад >>>")
    print("------------------------")
    print(">>>>>>>>>>>>>>>>>>>>>>>>>")
    #--------------------------------------------------------------------------------------
def print_sail():
    print("------------------------")
    print("     Меню:")
    print("------------------------")
    print("[1]. Цезарь - 8$")
    print("[2]. Обычный салат - 5$")
    print("[3]. Крабовый - 12$")
    print("[3]. Твистер - 12$")
    print("[4]. Фунчоза - 9$")
    print("[5]. Оливье - 6$")
    print("[6]. Назад >>>")
    print("------------------------")
    print(">>>>>>>>>>>>>>>>>>>>>>>>>")
    #--------------------------------------------------------------------------------------
def print_sup():
    print("------------------------")
    print("     Меню:")
    print("------------------------")
    print("[1]. Уха - 8$")
    print("[2]. Сщи - 6$")
    print("[3]. Рассольник - 10$")
    print("[4]. Назад >>>")
    print("------------------------")
    print(">>>>>>>>>>>>>>>>>>>>>>>>>")
    #--------------------------------------------------------------------------------------
total_price = 0

while True:
    print_profile()
    choice = input("Выберите из предложеных вариантов (1-2): ")
    print(">>>>>>>>>>>>>>>>>>>>>>>>>")
    # --------------------------------------------------------------------------------------
    if choice == '1':
        password = 2004
        inputPass = ''
        attempts = 3
        while attempts != 0:
            inputPass = int(input('Введите пароль (У вас есть ' + str(attempts) + ' попыток:)'))
            if inputPass == password:
                print('Пароль верный')
                print_kabinet()
                break
                right_val = '1'
                while True:
                    try:
                        choice = input("Выберите только раздел [1]: ")
                        if choice == right_val:
                            break
                        else:
                            print('Вы не выбрали раздел [1] ')
                    except:
                        print("Ошибка - это не число")
                if choice == '1':
                    print(">>>>>>>>>>>>>>>>>>>>>>>>>")
            if inputPass != password:
                attempts -= 1
                print('Пароль неверный')
            if attempts == 0:
                print('У вас закончились попытки, поэтому блокируем доступ: (')
                break
        right_val = '1'
        while True:
            try:
                choice = input("Выберите только раздел [1]: ")
                if choice == right_val:
                    break
                else:
                    print('Вы не выбрали раздел [1] ')
            except:
                print("Ошибка - это не число")
        if choice == '1':
            print(">>>>>>>>>>>>>>>>>>>>>>>>>")
    # --------------------------------------------------------------------------------------
    elif choice == '2':
        break

while True:
    print_razdel()
    choice = input("Выберите раздел (1-5): ")
    #--------------------------------------------------------------------------------------
    if choice == '1':
        print_fast()
        print("========================")
        choice = input("Выберите блюдо (1-4): ")
        if choice == '1':
            total_price += 5
            print("Вы выбрали картошку. Сумма заказа: $", total_price)
        elif choice == '2':
            total_price += 10
            print("Вы выбрали гамбургер. Сумма заказа: $", total_price)
        elif choice == '3':
            total_price += 12
            print("Вы выбрали твистер. Сумма заказа: $", total_price)
        elif choice == '4':
            total_price += 9
            print("Вы выбрали стрипсы. Сумма заказа: $", total_price)
        elif choice == '5':
            total_price += 6
            print("Вы выбрали луковые кольца. Сумма заказа: $", total_price)
        elif choice == '6':
            print_razdel()
            print("Вы вернулись на раздел")
            # --------------------------------------------------------------------------------------

    elif choice == '2':
        print_sail()
        choice = input("Выберите блюдо (1-4): ")
        if choice == '1':
            total_price += 8
            print("Вы выбрали цезарь. Сумма заказа: $", total_price)
        elif choice == '2':
            total_price += 5
            print("Вы выбрали обычный салат. Сумма заказа: $", total_price)
        elif choice == '3':
            total_price += 12
            print("Вы выбрали крабовый салат. Сумма заказа: $", total_price)
        elif choice == '4':
            total_price += 9
            print("Вы выбрали фунчоза. Сумма заказа: $", total_price)
        elif choice == '5':
            total_price += 6
            print("Вы выбрали оливье. Сумма заказа: $", total_price)
        elif choice == '6':
            print_razdel()
            print("Вы вернулись на раздел")
            #--------------------------------------------------------------------------------------

    elif choice == '3':
        print_sup()
        choice = input("Выберите блюдо (1-4): ")
        if choice == '1':
            total_price += 8
            print("Вы выбрали уху. Сумма заказа: $", total_price)
        elif choice == '2':
            total_price += 6
            print("Вы выбрали сщи. Сумма заказа: $", total_price)
        elif choice == '3':
            total_price += 10
            print("Вы выбрали рассольник. Сумма заказа: $", total_price)
        elif choice == '4':
            print_razdel()
            print("Вы вернулись назад в раздел")
            #--------------------------------------------------------------------------------------
    elif choice == '4':
        while True:
            print_profile()
            choice = input("Выберите из предложеных вариантов (1-2): ")
            print(">>>>>>>>>>>>>>>>>>>>>>>>>")
            # --------------------------------------------------------------------------------------
            if choice == '1':
                password = 2004
                inputPass = ''
                attempts = 3

                while attempts != 0:
                    inputPass = int(input('Введите пароль (У вас есть ' + str(attempts) + ' попыток:)'))
                    if inputPass == password:
                        print('Пароль верный')
                        print_kabinet()
                        break
                        right_val = '1'
                        while True:
                            try:
                                choice = input("Выберите только раздел [1]: ")
                                if choice == right_val:
                                    break
                                else:
                                    print('Вы не выбрали раздел [1] ')
                            except:
                                print("Ошибка - это не число")
                        if choice == '1':
                            print(">>>>>>>>>>>>>>>>>>>>>>>>>")
                    if inputPass != password:
                        attempts -= 1
                        print('Пароль неверный')
                    if attempts == 0:
                        print('У вас закончились попытки, поэтому блокируем доступ: (')
                        break
                right_val = '1'
                while True:
                    try:
                        choice = input("Выберите только раздел [1]: ")
                        if choice == right_val:
                            break
                        else:
                            print('Вы не выбрали раздел [1] ')
                    except:
                        print("Ошибка - это не число")
                if choice == '1':
                    print(">>>>>>>>>>>>>>>>>>>>>>>>>")
            # --------------------------------------------------------------------------------------
            elif choice == '2':
                break

    elif choice == '5':
        print("Спасибо за заказ! Общая сумма к оплате: $", total_price)
        break
        # --------------------------------------------------------------------------------------
    else:
        print("Выберите пункт из меню (1-5)")